In [2]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib as mpl

In [3]:
mpl.rcParams['figure.figsize'] = (20,10)

In [5]:
df1 = pd.read_csv('C:\\Users\\OfoghPC 32241004\\Downloads\\bengaluru_house_prices.csv')
df1['price'] = df1['price'].apply(lambda x: int(x*1200))

In [6]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [7]:
df2 = df1.drop(['area_type', 'society', 'balcony', 'availability'], axis='columns')

In [8]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [9]:
df3 = df2.dropna()

In [10]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [11]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\OfoghPC 32241004\AppData\Local\Temp\ipykernel_6040\2222900254.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

In [12]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [13]:
df3[~df3['total_sqft'].apply(is_float)]

                 location   size   total_sqft  bath   price  bhk
30              Yelahanka  4 BHK  2100 - 2850   4.0  223200    4
122                Hebbal  4 BHK  3067 - 8156   4.0  572400    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   64806    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   52188    2
188              KR Puram  2 BHK  1015 - 1540   2.0   68160    2
...                   ...    ...          ...   ...     ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   45828    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  146400    3
13059              Harlur  2 BHK  1200 - 1470   2.0   87312    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   70962    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  185400    4

[190 rows x 6 columns]

In [14]:
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [15]:
df4 = df3.copy()
df4['total_sqft'] = df4['total_sqft'].apply(convert_sqft_to_num)

In [16]:
df4['total_area'] = df4['total_sqft'].apply(lambda x: float(x*0.093))

In [17]:
df4 = df4.drop('total_sqft', axis='columns')

In [18]:
df4['price_per_sqm'] = df4['price']/df4['total_area']

,location,size,bath,price,bhk,total_area,price_per_sqm
0,Electronic City Phase II,2 BHK,2.0,46884,2,98.208,477.394917
1,Chikka Tirupathi,4 Bedroom,5.0,144000,4,241.800,595.533499
2,Uttarahalli,3 BHK,2.0,74400,3,133.920,555.555556
3,Lingadheeranahalli,3 BHK,3.0,114000,3,141.453,805.921401
4,Kothanur,2 BHK,2.0,61200,2,111.600,548.387097

In [25]:
len(df4.location.unique())

1293

In [23]:
df4.location = df4.location.apply(lambda x: x.strip())
location_stats = df4.groupby('location')['location'].agg('count').sort_values(ascending=False)

In [27]:
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [29]:
df4.location = df4.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)

In [ ]:
df